prototypesRise/drone-pic18f25k44/mcc_generated_files/pin_manager.h
// get/set IO_RA6 aliases
#define IO_RA6_TRIS                 TRISAbits.TRISA6
#define IO_RA6_LAT                  LATAbits.LATA6
#define IO_RA6_PORT                 PORTAbits.RA6
#define IO_RA6_WPU                  WPUAbits.WPUA6
#define IO_RA6_OD                   ODCONAbits.ODCA6
#define IO_RA6_ANS                  ANSELAbits.ANSELA6
#define IO_RA6_SetHigh()            do { LATAbits.LATA6 = 1; } while(0)
#define IO_RA6_SetLow()             do { LATAbits.LATA6 = 0; } while(0)
#define IO_RA6_Toggle()             do { LATAbits.LATA6 = ~LATAbits.LATA6; } while(0)
#define IO_RA6_GetValue()           PORTAbits.RA6
#define IO_RA6_SetDigitalInput()    do { TRISAbits.TRISA6 = 1; } while(0)
#define IO_RA6_SetDigitalOutput()   do { TRISAbits.TRISA6 = 0; } while(0)
#define IO_RA6_SetPullup()          do { WPUAbits.WPUA6 = 1; } while(0)
#define IO_RA6_ResetPullup()        do { WPUAbits.WPUA6 = 0; } while(0)
#define IO_RA6_SetPushPull()        do { ODCONAbits.ODCA6 = 0; } while(0)
#define IO_RA6_SetOpenDrain()       do { ODCONAbits.ODCA6 = 1; } while(0)
#define IO_RA6_SetAnalogMode()      do { ANSELAbits.ANSELA6 = 1; } while(0)
#define IO_RA6_SetDigitalMode()     do { ANSELAbits.ANSELA6 = 0; } while(0)

// get/set IO_RA7 aliases
#define IO_RA7_TRIS                 TRISAbits.TRISA7
#define IO_RA7_LAT                  LATAbits.LATA7
#define IO_RA7_PORT                 PORTAbits.RA7
#define IO_RA7_WPU                  WPUAbits.WPUA7
#define IO_RA7_OD                   ODCONAbits.ODCA7
#define IO_RA7_ANS                  ANSELAbits.ANSELA7
#define IO_RA7_SetHigh()            do { LATAbits.LATA7 = 1; } while(0)
#define IO_RA7_SetLow()             do { LATAbits.LATA7 = 0; } while(0)
#define IO_RA7_Toggle()             do { LATAbits.LATA7 = ~LATAbits.LATA7; } while(0)
#define IO_RA7_GetValue()           PORTAbits.RA7
#define IO_RA7_SetDigitalInput()    do { TRISAbits.TRISA7 = 1; } while(0)
#define IO_RA7_SetDigitalOutput()   do { TRISAbits.TRISA7 = 0; } while(0)
#define IO_RA7_SetPullup()          do { WPUAbits.WPUA7 = 1; } while(0)
#define IO_RA7_ResetPullup()        do { WPUAbits.WPUA7 = 0; } while(0)
#define IO_RA7_SetPushPull()        do { ODCONAbits.ODCA7 = 0; } while(0)
#define IO_RA7_SetOpenDrain()       do { ODCONAbits.ODCA7 = 1; } while(0)
#define IO_RA7_SetAnalogMode()      do { ANSELAbits.ANSELA7 = 1; } while(0)
#define IO_RA7_SetDigitalMode()     do { ANSELAbits.ANSELA7 = 0; } while(0)

// get/set GEN aliases
#define GEN_TRIS                 TRISBbits.TRISB0
#define GEN_LAT                  LATBbits.LATB0
#define GEN_PORT                 PORTBbits.RB0
#define GEN_WPU                  WPUBbits.WPUB0
#define GEN_OD                   ODCONBbits.ODCB0
#define GEN_ANS                  ANSELBbits.ANSELB0
#define GEN_SetHigh()            do { LATBbits.LATB0 = 1; } while(0)
#define GEN_SetLow()             do { LATBbits.LATB0 = 0; } while(0)
#define GEN_Toggle()             do { LATBbits.LATB0 = ~LATBbits.LATB0; } while(0)
#define GEN_GetValue()           PORTBbits.RB0
#define GEN_SetDigitalInput()    do { TRISBbits.TRISB0 = 1; } while(0)
#define GEN_SetDigitalOutput()   do { TRISBbits.TRISB0 = 0; } while(0)
#define GEN_SetPullup()          do { WPUBbits.WPUB0 = 1; } while(0)
#define GEN_ResetPullup()        do { WPUBbits.WPUB0 = 0; } while(0)
#define GEN_SetPushPull()        do { ODCONBbits.ODCB0 = 0; } while(0)
#define GEN_SetOpenDrain()       do { ODCONBbits.ODCB0 = 1; } while(0)
#define GEN_SetAnalogMode()      do { ANSELBbits.ANSELB0 = 1; } while(0)
#define GEN_SetDigitalMode()     do { ANSELBbits.ANSELB0 = 0; } while(0)

// get/set IRQ aliases
#define IRQ_TRIS                 TRISBbits.TRISB1
#define IRQ_LAT                  LATBbits.LATB1
#define IRQ_PORT                 PORTBbits.RB1
#define IRQ_WPU                  WPUBbits.WPUB1
#define IRQ_OD                   ODCONBbits.ODCB1
#define IRQ_ANS                  ANSELBbits.ANSELB1
#define IRQ_SetHigh()            do { LATBbits.LATB1 = 1; } while(0)
#define IRQ_SetLow()             do { LATBbits.LATB1 = 0; } while(0)
#define IRQ_Toggle()             do { LATBbits.LATB1 = ~LATBbits.LATB1; } while(0)
#define IRQ_GetValue()           PORTBbits.RB1
#define IRQ_SetDigitalInput()    do { TRISBbits.TRISB1 = 1; } while(0)
#define IRQ_SetDigitalOutput()   do { TRISBbits.TRISB1 = 0; } while(0)
#define IRQ_SetPullup()          do { WPUBbits.WPUB1 = 1; } while(0)
#define IRQ_ResetPullup()        do { WPUBbits.WPUB1 = 0; } while(0)
#define IRQ_SetPushPull()        do { ODCONBbits.ODCB1 = 0; } while(0)
#define IRQ_SetOpenDrain()       do { ODCONBbits.ODCB1 = 1; } while(0)
#define IRQ_SetAnalogMode()      do { ANSELBbits.ANSELB1 = 1; } while(0)
#define IRQ_SetDigitalMode()     do { ANSELBbits.ANSELB1 = 0; } while(0)

// get/set RB2 procedures
#define RB2_SetHigh()            do { LATBbits.LATB2 = 1; } while(0)
#define RB2_SetLow()             do { LATBbits.LATB2 = 0; } while(0)
#define RB2_Toggle()             do { LATBbits.LATB2 = ~LATBbits.LATB2; } while(0)
#define RB2_GetValue()              PORTBbits.RB2
#define RB2_SetDigitalInput()    do { TRISBbits.TRISB2 = 1; } while(0)
#define RB2_SetDigitalOutput()   do { TRISBbits.TRISB2 = 0; } while(0)
#define RB2_SetPullup()             do { WPUBbits.WPUB2 = 1; } while(0)
#define RB2_ResetPullup()           do { WPUBbits.WPUB2 = 0; } while(0)
#define RB2_SetAnalogMode()         do { ANSELBbits.ANSELB2 = 1; } while(0)
#define RB2_SetDigitalMode()        do { ANSELBbits.ANSELB2 = 0; } while(0)

// get/set RB3 procedures
#define RB3_SetHigh()            do { LATBbits.LATB3 = 1; } while(0)
#define RB3_SetLow()             do { LATBbits.LATB3 = 0; } while(0)
#define RB3_Toggle()             do { LATBbits.LATB3 = ~LATBbits.LATB3; } while(0)
#define RB3_GetValue()              PORTBbits.RB3
#define RB3_SetDigitalInput()    do { TRISBbits.TRISB3 = 1; } while(0)
#define RB3_SetDigitalOutput()   do { TRISBbits.TRISB3 = 0; } while(0)
#define RB3_SetPullup()             do { WPUBbits.WPUB3 = 1; } while(0)
#define RB3_ResetPullup()           do { WPUBbits.WPUB3 = 0; } while(0)
#define RB3_SetAnalogMode()         do { ANSELBbits.ANSELB3 = 1; } while(0)
#define RB3_SetDigitalMode()        do { ANSELBbits.ANSELB3 = 0; } while(0)

