prototypesRise/drone-pic18f25k44/mcc_generated_files/pin_manager.h
// get/set WCSN aliases
#define WCSN_TRIS                 TRISCbits.TRISC7
#define WCSN_LAT                  LATCbits.LATC7
#define WCSN_PORT                 PORTCbits.RC7
#define WCSN_WPU                  WPUCbits.WPUC7
#define WCSN_OD                   ODCONCbits.ODCC7
#define WCSN_ANS                  ANSELCbits.ANSELC7
#define WCSN_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define WCSN_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define WCSN_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define WCSN_GetValue()           PORTCbits.RC7
#define WCSN_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define WCSN_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define WCSN_SetPullup()          do { WPUCbits.WPUC7 = 1; } while(0)
#define WCSN_ResetPullup()        do { WPUCbits.WPUC7 = 0; } while(0)
#define WCSN_SetPushPull()        do { ODCONCbits.ODCC7 = 0; } while(0)
#define WCSN_SetOpenDrain()       do { ODCONCbits.ODCC7 = 1; } while(0)
#define WCSN_SetAnalogMode()      do { ANSELCbits.ANSELC7 = 1; } while(0)
#define WCSN_SetDigitalMode()     do { ANSELCbits.ANSELC7 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);


/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handler for the IOCBF1 pin functionality
 * @Example
    IOCBF1_ISR();
 */
void IOCBF1_ISR(void);

/**
  @Summary
    Interrupt Handler Setter for IOCBF1 pin interrupt-on-change functionality

  @Description
    Allows selecting an interrupt handler for IOCBF1 at application runtime
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    InterruptHandler function pointer.

  @Example
    PIN_MANAGER_Initialize();
    IOCBF1_SetInterruptHandler(MyInterruptHandler);

*/
void IOCBF1_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Dynamic Interrupt Handler for IOCBF1 pin

  @Description
    This is a dynamic interrupt handler to be used together with the IOCBF1_SetInterruptHandler() method.
    This handler is called every time the IOCBF1 ISR is executed and allows any function to be registered at runtime.
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCBF1_SetInterruptHandler(IOCBF1_InterruptHandler);

*/
extern void (*IOCBF1_InterruptHandler)(void);

/**
  @Summary
    Default Interrupt Handler for IOCBF1 pin

  @Description
    This is a predefined interrupt handler to be used together with the IOCBF1_SetInterruptHandler() method.
    This handler is called every time the IOCBF1 ISR is executed. 
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCBF1_SetInterruptHandler(IOCBF1_DefaultInterruptHandler);

*/
void IOCBF1_DefaultInterruptHandler(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/